# 14.그룹화
-> 보통 그룹화는 동일한 값을 가진 것들끼리 합쳐서 통계 또는 평균 등의 값을 계산하기 위해 사용

In [1]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col= '지원번호')
df

       이름   학교    키   국어   영어   수학  과학  사회        SW특기
지원번호
1번    채치수  북산고  197   90   85  100  95  85      Python
2번    정대만  북산고  184   40   35   50  55  25        Java
3번    송태섭  북산고  168   80   75   70  80  75  Javascript
4번    서태웅  북산고  187   40   60   70  75  80         NaN
5번    강백호  북산고  188   15   20   10  35  10         NaN
6번    변덕규  능남고  202   80  100   95  85  80           C
7번    황태산  능남고  188   55   65   45  40  35      PYTHON
8번    윤대협  능남고  190  100   85   90  95  95          C#

In [3]:
df.groupby('학교')  # 학교를 기준으로 그룹

In [5]:
df.groupby('학교').get_group('북산고') # 북산고만 가지고 옴.

       이름   학교    키  국어  영어   수학  과학  사회        SW특기
지원번호
1번    채치수  북산고  197  90  85  100  95  85      Python
2번    정대만  북산고  184  40  35   50  55  25        Java
3번    송태섭  북산고  168  80  75   70  80  75  Javascript
4번    서태웅  북산고  187  40  60   70  75  80         NaN
5번    강백호  북산고  188  15  20   10  35  10         NaN

In [6]:
df.groupby('학교').mean() # 학교 컬럼을 기준으로 계산 가능한 것들의 평균을 구함.

C:\Users\user\AppData\Local\Temp\ipykernel_15980\1605946280.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('학교').mean()

              키         국어         영어         수학         과학    사회
학교
능남고  193.333333  78.333333  83.333333  76.666667  73.333333  70.0
북산고  184.800000  53.000000  55.000000  60.000000  68.000000  55.0

In [7]:
df.groupby('학교').size() # 각 그룹의 크기 정보 즉, 그룹별 데이터가 몇 개씩 있는지 확인할 수 있다.

학교
능남고    3
북산고    5
dtype: int64

In [9]:
df.groupby('학교').size()['능남고'] # 학교로 그룹화를 한 후에 능남고에 해당하는 데이터의 수를 알아봄

3

In [10]:
df.groupby('학교')['키'].mean() # 학교로 그룹화를 한 뒤에 키의 평균데이터

학교
능남고    193.333333
북산고    184.800000
Name: 키, dtype: float64

In [11]:
df.groupby('학교')[['국어','영어','수학']].mean() # 학교로 그룹화를 지어 학교별 국어 영어 수학의 평균값을 구함

            국어         영어         수학
학교
능남고  78.333333  83.333333  76.666667
북산고  53.000000  55.000000  60.000000

In [12]:
df.groupby('학교')[['이름','SW특기']].count() # 학교로 그룹화를 한 뒤에 각 학교별 sw특기 데이터 수와 이름의 수 가지고 옴

     이름  SW특기
학교
능남고   3     3
북산고   5     3